обучающие_материалы-tutorials/cyclone/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          72;
        startFace       88217;
    }
    outlet
    {
        type            patch;
        nFaces          69;
        startFace       88289;
    }
    internalFaces
    {
        type            internal;
        inGroups        List<word> 1(internal);
        nFaces          0;
        startFace       88358;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          5755;
        startFace       88358;
    }
)

// ************************************************************************* //
